/* Done Button for closing the mini browser */
"i18N_YMB_Done_Button" = "Valmis";

/* Pop up menu action label */
"i18N_YMB_Search_Popup_Label" = "Haku";

/* Open in safari action label */
"i18N_YMB_Share_Action_Open_in_Safari" = "Avaa Safarissa";

/* Browser Back accessibility label */
"i18N_YMB_back_access_label" = "Mene takaisin.";

/* Browser Back accessibility hint */
"i18N_YMB_back_access_hint" = "Kaksoisnapsauta palataksesi edelliselle web-sivulle.";

/* Browser share button accessibility label */
"i18N_YMB_share_access_label" = "Jaa.";
